Autodesk.Revit.DB.ViewDisplayBackground.CreateSky
Creates an object that can be passed to DBView::setBackground function
to set the background of the SunAndClouds type.
Returns:
New background object to pass to DBView::setBackground.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.CreateImage(System.String,Autodesk.Revit.DB.ViewDisplayBackgroundImageFlags,Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV)
Creates an object that can be passed to DBView::setBackground function
to set the background of the Image type.
imagePath:
File path with the image to be used.
flags:
Combination of flags (binary) that control how image is displayed in relation
to the view/crop boundary.
imageOffsets:
Horizontal (u) and vertical (v) offsets of the image.
imageScales:
Horizontal (u) and vertical (v) scales of the image (1 == no change).
Returns:
New background object to pass to DBView::setBackground.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The file specified by imagePath is not an image file.
A valid image file should be in one of the following formats: bmp, jpg, jpeg, png, tif.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The  file specified by imagePath doesn't exist.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.CreateGradient(Autodesk.Revit.DB.Color,Autodesk.Revit.DB.Color,Autodesk.Revit.DB.Color)
Creates an object that can be passed to DBView::setBackground function
to set the background of the Gradient type.
skyColor:
The top of the sky gradient if the sky is visible.
horizonColor:
The bottom or the sky gradient if the sky is visible,
or the top of the ground gradient otherwise.
groundColor:
The ground color if the sky is visible (ground shown in uniform color),
or the bottom of the ground gradient if the sky is not visible.
Returns:
New background object to pass to DBView::setBackground.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.VerticalImageScale
The vertical scale of the background image; the scale of 1.0 puts the image pixel-to-pixel.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.HorizontalImageScale
The horizontal scale of the background image; the scale of 1.0 puts the image pixel-to-pixel.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.VerticalImageOffset
The distance between the bottom viewport boundary and the bottom edge of the background image.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.HorizontalImageOffset
The distance between the left viewport boundary and the left edge of the background image.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.ImageFlags
The image alignment indicators when the type is 'Image'.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.ImagePath
The path to the image file when the type is 'Image'.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.SkyColor
The color of the sky when the type is 'Gradient'.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.BackgroundColor
The color of the horizon when the type is 'Gradient'.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.GroundColor
The color of the ground when the type is 'Gradient' or 'SunAndClouds'.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.Type
The type of the background.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground
Set of values that control how background is drawn in a view.
Background can only be set for a 3d view or for a section or elevation view.
Since:
2014